past-seminars.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-06-07 Wed 14:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Past Seminars at the [[file:index.org][Compositional Systems and Methods Group]]</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="tallcat.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Past Seminars at the <a href="index.html">Compositional Systems and Methods Group</a></h1>
<p>
<a href="http://nicolasbehr.com/">Nick Behr</a>. <span class="underline">Category-Theoretical Rewriting Theory 2.0: On Rule Algebras and Tracelets</span>. (21/11/2019)
</p>

<p>
<a href="https://emorehouse.wescreates.wesleyan.edu/">Ed Morehouse</a>. <span class="underline">Double-Categorical Models of Directed Universes</span>. (12/12/2019)
</p>

<p>
João de Paixão. <span class="underline">Diagrams in the Classroom</span>. (30/01/2020)
</p>

<p>
<a href="https://erischel.com/">Eigil Rischel</a>. <span class="underline">0-1 Laws and Category Theory</span>. (06/02/2020)
</p>

<p>
Nathan Haydon. <span class="underline">Compositional Diagrammatic First-Order Logic</span>. (13/02/2020)
</p>

<p>
<a href="http://www.zanasi.com/fabio/">Fabio Zanasi</a>. <span class="underline">A Categorical Perspective on Bayseian Resoning</span>. (20/02/2020)
</p>

<p>
<a href="https://julesh.com/">Jules Hedges</a>. <span class="underline">Open Games: The Long Road to Practical Applications</span>. (09/04/2020)
</p>

<p>
Jens Seeber. <span class="underline">Logical Completeness for String Diagrams</span>. (23/04/2020)
</p>

<p>
<a href="https://personal-homepages.mis.mpg.de/rezaghol/">Sharwin Rezagoli</a>. <span class="underline">The Support as a Morphism from Probability to Possibility with an Application to the Entropy Theory of Dynamical Systems</span>. (14/05/2020)
</p>

<p>
<a href="http://mat.uab.es/~kock/">Joachim Kock</a>. <span class="underline">Whole-Grain Petri Nets and Processes</span>. (21/05/2020)
</p>

<p>
Stephan Spahn. <span class="underline">Reduction of Mixed-Variance Recursion Schemes via Two-Sided Fibrations</span>. (28/05/2020)
</p>

<p>
<a href="https://www.irif.fr/~ahadziha/">Amar Hadzihasanovic</a>. <span class="underline">Diagrammatic Sets: Weak Higher Categories for Rewriting</span>. (11/06/2020)
</p>

<p>
<a href="https://www.mansfield.ox.ac.uk/dr-carmen-constantin">Carmen Constantin</a>. <span class="underline">Topos Theoretic Perspective on Entropy</span>. (30/06/2020)
</p>

<p>
<a href="https://jdgallag.wordpress.com/">Jonathan Gallagher</a>. <span class="underline">Introduction to Differential Categories</span>. (06/08/2020)
</p>

<p>
<a href="https://pages.cpsc.ucalgary.ca/~robin/">Robin Cockett</a>. <span class="underline">Fibrations for Partial Maps</span>. (13/08/2020)
</p>

<p>
<a href="https://mysite.science.uottawa.ca/mkarvone/">Martti Karvonen</a>. <span class="underline">Towards Categorical Composable Cryptography</span>. (20/08/2020)
</p>

<p>
Fabrizio Genovese. <span class="underline">Sigma Nets and Yoneda Hacking: Running Tests Over a Nice Compromise</span>. (27/08/2020)
</p>

<p>
<a href="https://hjmb.co.uk/">Hector Miller-Bakewell</a>. <span class="underline">Quantum Graphical Calculi and Their Algebraic Underpinnings</span>. (03/09/2020)
</p>

<p>
<a href="http://piedeleu.com/">Robin Piedeleu</a>. <span class="underline">A Diagrammatic Axiomatisation of Finite-State Automata</span>. (01/10/2020)
</p>

<p>
<a href="https://www.dmif.uniud.it/dottorato/dottorandi/davide.castelnovo/">Davide Castelnovo</a>. <span class="underline">Equational Theories in an Enriched Context</span>. (08/10/2020)
</p>

<p>
<a href="https://personal.cis.strath.ac.uk/james.wood.100/">James Wood</a>. <span class="underline">A Hygeine and Framework for Linear Calculi with Binding</span>. (22/10/2020)
</p>

<p>
<a href="https://diliberti.github.io/">Ivan Di Liberti</a>. <span class="underline">Formal Model Theory and Higher Topology</span>. (29/10/2020)
</p>

<p>
<a href="https://thalis.math.upatras.gr/~cvasilak/">Christina Vasilakopoulou</a>. <span class="underline">Categorical Semantics of Cyber-Physical Systems</span>. (05/11/2020)
</p>

<p>
Evangelia Aleiferi. <span class="underline">Cartesian Double Categories and Profunctors</span>. (26/11/2020)
</p>

<p>
<a href="https://elenadilavore.github.io/">Elena Di Lavore</a>. <span class="underline">Compositional Modelling of Network Games</span>. (21/01/2021)
</p>

<p>
<a href="https://www.cs.ox.ac.uk/people/cole.comfort/">Cole Comfort</a>. <span class="underline">Categorical Semantics of the ZX-Calculus</span>. (28/01/2021)
</p>

<p>
<a href="https://sites.google.com/view/soichirofujii/">Soichiro Fuji</a>. <span class="underline">Algebraic Theories, Bimodels and Gabriel-Ulmer Duality</span>. (11/02/2021)
</p>

<p>
<a href="https://www.jasonparkermath.com/">Jason Parker</a>. <span class="underline">Isotropy of Algebraic Theories</span>. (04/03/2021)
</p>

<p>
<a href="https://matteocapucci.wordpress.com/">Matteo Capucci</a>. <span class="underline">My Name is Stochastic Calculus by Everybody Calls me Calculus</span>. (11/03/2021)
</p>

<p>
<a href="https://gianola.people.unibz.it/">Alessandro Gianola</a>. <span class="underline">Toward a Compositional Verification of Data-Aware Processes via CospanSpan(Graph)</span>. (25/03/2021)
</p>

<p>
<a href="https://www.ioc.ee/~cneste/">Chad Nester</a>. <span class="underline">Functorial Semantics for Partial and Relational Theories</span>. (15/04/2021)
</p>

<p>
<a href="http://www.cs.unibo.it/~dallago/">Ugo Dal Lago</a>. <span class="underline">On Differential Program Semantics</span>.(06/05/2021)
</p>

<p>
Torie Barrett. <span class="underline">Atomic Flows and Normalisation</span>. (27/05/2021)
</p>

<p>
<a href="https://www.brunogavranovic.com/">Bruno Gavranović</a>. <span class="underline">Neural Networks Through the Lens of Category Theory</span>. (03/06/2021)
</p>

<p>
<a href="https://ncatlab.org/nlab/show/Todd+Trimble">Todd Trimble</a>. <span class="underline">Introduction to Pletheories</span>. (17/06/2021)
</p>

<p>
<a href="https://www.cs.ox.ac.uk/people/giovanni.defelice/">Giovanni De Felice</a>. <span class="underline">&lt;Unknown Title&gt;</span>. (10/10/2021)
</p>

<p>
<a href="https://www.cs.ox.ac.uk/people/cole.comfort/">Cole Comfort</a>. <span class="underline">A Graphical Calculus for Lagrangian Relations</span>. (16/10/2021)
</p>

<p>
<a href="https://www.ioc.ee/~mroman/">Mario Román</a>. <span class="underline">A Canonical Algebra of Open Transition Systems</span>. (26/10/2021)
</p>

<p>
<a href="https://www.ioc.ee/~cneste/">Chad Nester</a>. <span class="underline">Material Histories and Proarrow Equipments</span>. (18/11/2021)
</p>

<p>
<a href="https://www.seiller.org/">Thomas Seiller</a>. <span class="underline">Linear Realisability, Dynamical Systems and Lower Bounds in Complexity</span>. (09/12/2021)
</p>

<p>
<a href="https://www.dmif.uniud.it/en/phd-courses/imf/phd-students/davide.castelnovo/">Davide Castelnovo</a>. <span class="underline">Fuzzy Algebraic Theories</span>. (27/01/2022)
</p>

<p>
<a href="https://tetrapharmakon.github.io/">Fosco Loregian</a>. <span class="underline">Fibrational Linguistics 1: First Concepts</span>. (03/02/2022)
</p>

<p>
<a href="https://www.ioc.ee/~mroman/">Mario Román</a>. <span class="underline">Premonoidal Streams</span>. (10/02/2022)
</p>

<p>
<a href="https://maaikezwart.com/">Maiike Zwart</a>. <span class="underline">Lessons From Failing Distributive Laws</span>. (10/04/2022)
</p>

<p>
<a href="https://www.bmbumpus.com/">Benjamin Bumpus</a>. <span class="underline">Spined Categories: Generalising Tree-Width Beyond Graphs</span>. (17/03/2022)
</p>

<p>
Tanguy Massacrier. <span class="underline">From Combinatorial Species to General Differential 2-Rigs</span>. (31/03/2022)
</p>

<p>
<a href="https://www.ioc.ee/~cneste/">Chad Nester</a>. <span class="underline">On the Tensor Product of Symmetric Monoidal Theories</span>. (21/04/2022)
</p>

<p>
<a href="https://etagreta.github.io/">Greta Coraglia</a>. <span class="underline">Coding Deductive Systems Into a 2-Category</span>. (05/05/2022)
</p>

<p>
Vladimir Zamdzhiev. <span class="underline">Central Submonads and Notions of Computations</span>. (05/07/2022)
</p>

<p>
Gullaume Laplante-Anfossi. <span class="underline">Categorical Coherence, Polytopes, and Koszul Duality</span>. (17/10/2022)
</p>

<p>
Mario Román. <span class="underline">Evidential Decision Theory via Partial Markov Categories</span>. (09/11/2022)
</p>

<p>
Eigil Rischel. <span class="underline">String Diagrams for Machine Learning</span>. (24/11/2022)
</p>

<p>
Félix Loubaton. <span class="underline">The Other Definitions of Strict Omega-Categories</span>. (12/01/2023)
</p>

<p>
Matt Earnshaw. <span class="underline">Introduction to the Produoidal Algebra of Process Decomposition</span>. (02/02/2023)
</p>

<p>
Mario Román. <span class="underline">The Produoidal Theory of Process Decomposition</span>. (09/02/2023)
</p>

<p>
Amar Hadzihasanovic. <span class="underline">Higher-Dimensional Subdiagram Matching</span>. (16/02/2023)
</p>

<p>
Fosco Loregian. <span class="underline">Bicategories of Automata, Automata in Bicategories</span>. (23/02/2023)
</p>

<p>
Elena Di Lavore. <span class="underline">Evidential Decision Theory via Partial Markov Categories</span>. (09/03/2023)
</p>

<p>
Chad Nester and Niels Voorneveld. <span class="underline">Choice and Iteration in the Free Cornering</span>. (13/04/2023)
</p>
</div>
</body>
</html>
